#Add repositories
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

#command line softwares
brew "ansible"
brew "awscli"
brew "git"
brew "go"
brew "htop"
brew "neofetch"
brew "netcat"
brew "python3"
brew "terraform"
brew "tree"
brew "tmux"
brew "heroku"
brew "vim"
brew "wget"
brew "zsh"

#UI softwares
cask "1password"
cask "alfred"
cask "discord"
cask "evernote"
cask "flash-player"
cask "google-chrome"
cask "iterm2"
cask "java"
cask "java8"
cask "microsoft-office"
cask "monodraw"
cask "slack"
cask "spotify"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
cask "vlc"
cask "visual-studio-code"
cask "xquartz"

#Apps from Appstore
mas "serial", id: 111
mas "Trello", id: 1278508951