#Add repositories
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

#command line softwares
brew "ansible"
brew "git"
brew "helm"
brew "htop"
brew "kubernetes-cli"
brew "neofetch"
brew "netcat"
brew "pyenv"
brew "terraform"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zsh"
brew "zsh-completions"

#UI softwares
cask "1password"
cask "appcleaner"
cask "arduino"
cask "discord"
cask "dropbox"
cask "flash-player"
cask "firefox-developer-edition"
cask "iterm2"
cask "microsoft-office"
cask "monodraw"
cask "openemu"
cask "spotify"
cask "tor-browser"
cask "the-unarchiver"
cask "qbittorrent"
cask "serial"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
cask "vlc"
cask "visual-studio-code"
cask "whatsapp"
cask "wireshark"

#Apps from Appstore
mas "Trello", id: 1278508951